In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\parkhanna\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: numpy>=1.18.5 in c:\users\parkhanna\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\users\parkhanna\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\parkhanna\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\parkhanna\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [1]:
import pandas as pd
import numpy as np

In [3]:
data = [1,2,3,4]

In [4]:
s = pd.Series(data)

In [5]:
print(s)

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
from pandas import Series

In [7]:
data = np.arange(5)
s = Series(data)
print(s)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [9]:
product_dic = {
    'pen' : 'pencil',
    'era' : 'erasser',
    'note' : 'notebook'
}

price_dic = {
    'pen' : 200,
    'era' : 500,
    'note' : 1500
}

num_dic = {
    'pen' : 13,
    'era' : 5,
    'note' : 10
}

product = pd.Series(product_dic)
price = pd.Series(price_dic)
num = pd.Series(num_dic)

sum = pd.DataFrame({
    'product' : product,
    'price' : price,
    'num' : num
})

total_price = sum['price'] * sum['num']

sum['total_price'] = total_price

print(sum)

       product  price  num  total_price
pen     pencil    200   13         2600
era    erasser    500    5         2500
note  notebook   1500   10        15000

In [10]:
data = [1000,2000,3000]
s = Series(data)
print(s.index)
print(s.index.to_list())

RangeIndex(start=0, stop=3, step=1)
[0, 1, 2]

In [11]:
data = [1000, 2000, 3000]
s = Series(data)
s.index = ["merona", "gugucorn", "hagendarz"]
print(s)

merona       1000
gugucorn     2000
hagendarz    3000
dtype: int64

In [12]:
price = [35000, 14000, 23000, 17000, 34000]
date = ["2022-05-02", "2022-05-09", "2022-05-16", "2022-05-23", "2022-05-30"]
s = Series(price, date)
print(s)

2022-05-02    35000
2022-05-09    14000
2022-05-16    23000
2022-05-23    17000
2022-05-30    34000
dtype: int64

In [13]:
data = [1000, 2000, 3000]
index = ["merona", "gugucorn", "hargendarz"]
s = Series(data = data, index = index)
print(s.iloc[0:2])

merona      1000
gugucorn    2000
dtype: int64

In [14]:
data = [1000, 2000, 3000]
index = ["merona", "gugucorn", "hargendarz"]
s = Series(data = data, index = index)

indice = ["merona", "hargendarz"]
print(s.loc[indice])
print(s.loc[['merona','hargendarz']])

merona        1000
hargendarz    3000
dtype: int64
merona        1000
hargendarz    3000
dtype: int64

In [15]:
data = [1000, 2000, 3000]
index = ["merona", "gugucorn", "hargendarz"]
s = Series(data = data, index = index)

indice = [0,2]
print(s.iloc[indice])
print(s.iloc[[0,2]])

merona        1000
hargendarz    3000
dtype: int64
merona        1000
hargendarz    3000
dtype: int64

In [17]:
data = [1000, 2000, 3000]
index = ["merona", "gugucorn", "hargendarz"]
s = Series(data = data, index = index)

s.loc['merona'] = 500
print(s)

merona         500
gugucorn      2000
hargendarz    3000
dtype: int64

In [18]:
s.loc['bibibig'] = 500
print(s)

merona         500
gugucorn      2000
hargendarz    3000
bibibig        500
dtype: int64

In [19]:
s = s.drop('merona')
print(s)

gugucorn      2000
hargendarz    3000
bibibig        500
dtype: int64

In [20]:
dates = pd.date_range('20130101', periods = 6)

In [21]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [23]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns = list('ABCD'))

In [24]:
df

                   A         B         C         D
2013-01-01 -0.180055 -0.184300 -0.489631 -0.294932
2013-01-02 -0.985149  1.643598 -1.319322  1.879614
2013-01-03 -0.095298  2.385948 -0.342735  0.572610
2013-01-04 -0.720945 -0.965473 -1.264741  0.109659
2013-01-05 -0.660726  0.894251  0.352209 -0.995835
2013-01-06  0.196834 -0.040456 -0.176135 -0.873157

In [27]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1, index = list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4, dtype = 'int32'),
                    'E' : pd.Categorical(["test", "train", "test", "train"]),
                    'F' : 'foo'
})

In [35]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [36]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [37]:
df2.tail()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [38]:
df2.tail(2)

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [39]:
df2.head()

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [40]:
df2.head(2)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo

In [41]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [42]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [43]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [44]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [45]:
df.values

array([[-0.18005533, -0.18429989, -0.4896306 , -0.29493186],
       [-0.98514907,  1.6435983 , -1.31932207,  1.87961422],
       [-0.09529815,  2.38594799, -0.34273547,  0.57260967],
       [-0.7209447 , -0.96547329, -1.26474123,  0.10965946],
       [-0.66072649,  0.8942513 ,  0.35220868, -0.99583546],
       [ 0.19683405, -0.04045596, -0.17613534, -0.87315696]])

In [46]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

# data stats summary info

In [47]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.407557  0.622261 -0.540059  0.066327
std    0.449549  1.252065  0.648456  1.066540
min   -0.985149 -0.965473 -1.319322 -0.995835
25%   -0.705890 -0.148339 -1.070964 -0.728601
50%   -0.420391  0.426898 -0.416183 -0.092636
75%   -0.116487  1.456262 -0.217785  0.456872
max    0.196834  2.385948  0.352209  1.879614

In [48]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

# data transform

In [49]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.180055   -0.985149   -0.095298   -0.720945   -0.660726    0.196834
B   -0.184300    1.643598    2.385948   -0.965473    0.894251   -0.040456
C   -0.489631   -1.319322   -0.342735   -1.264741    0.352209   -0.176135
D   -0.294932    1.879614    0.572610    0.109659   -0.995835   -0.873157

In [50]:
df2.T

,0,1,2,3
A,1.0,1.0,1.0,1.0
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1.0,1.0,1.0,1.0
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

# axis = 1 sort

In [51]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.294932 -0.489631 -0.184300 -0.180055
2013-01-02  1.879614 -1.319322  1.643598 -0.985149
2013-01-03  0.572610 -0.342735  2.385948 -0.095298
2013-01-04  0.109659 -1.264741 -0.965473 -0.720945
2013-01-05 -0.995835  0.352209  0.894251 -0.660726
2013-01-06 -0.873157 -0.176135 -0.040456  0.196834

In [52]:
df2.sort_index(axis=1, ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [53]:
df.sort_index(axis=1, ascending=True)

                   A         B         C         D
2013-01-01 -0.180055 -0.184300 -0.489631 -0.294932
2013-01-02 -0.985149  1.643598 -1.319322  1.879614
2013-01-03 -0.095298  2.385948 -0.342735  0.572610
2013-01-04 -0.720945 -0.965473 -1.264741  0.109659
2013-01-05 -0.660726  0.894251  0.352209 -0.995835
2013-01-06  0.196834 -0.040456 -0.176135 -0.873157

In [54]:
df2.sort_index(axis=1, ascending=True)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

# axis = 0 sort

In [55]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2013-01-06  0.196834 -0.040456 -0.176135 -0.873157
2013-01-05 -0.660726  0.894251  0.352209 -0.995835
2013-01-04 -0.720945 -0.965473 -1.264741  0.109659
2013-01-03 -0.095298  2.385948 -0.342735  0.572610
2013-01-02 -0.985149  1.643598 -1.319322  1.879614
2013-01-01 -0.180055 -0.184300 -0.489631 -0.294932

In [56]:
df2.sort_index(axis=0, ascending=False)

     A          B    C  D      E    F
3  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
0  1.0 2013-01-02  1.0  3   test  foo

In [57]:
df.sort_index(axis=0, ascending=True)

                   A         B         C         D
2013-01-01 -0.180055 -0.184300 -0.489631 -0.294932
2013-01-02 -0.985149  1.643598 -1.319322  1.879614
2013-01-03 -0.095298  2.385948 -0.342735  0.572610
2013-01-04 -0.720945 -0.965473 -1.264741  0.109659
2013-01-05 -0.660726  0.894251  0.352209 -0.995835
2013-01-06  0.196834 -0.040456 -0.176135 -0.873157

In [58]:
df2.sort_index(axis=0, ascending=True)

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

# data value sort

In [59]:
df.sort_values(by = "B")

                   A         B         C         D
2013-01-04 -0.720945 -0.965473 -1.264741  0.109659
2013-01-01 -0.180055 -0.184300 -0.489631 -0.294932
2013-01-06  0.196834 -0.040456 -0.176135 -0.873157
2013-01-05 -0.660726  0.894251  0.352209 -0.995835
2013-01-02 -0.985149  1.643598 -1.319322  1.879614
2013-01-03 -0.095298  2.385948 -0.342735  0.572610

In [60]:
df2.sort_values(by = "A")

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [61]:
df['A']

2013-01-01   -0.180055
2013-01-02   -0.985149
2013-01-03   -0.095298
2013-01-04   -0.720945
2013-01-05   -0.660726
2013-01-06    0.196834
Freq: D, Name: A, dtype: float64

In [62]:
df2['B']

0   2013-01-02
1   2013-01-02
2   2013-01-02
3   2013-01-02
Name: B, dtype: datetime64[ns]

# data division

In [63]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.180055 -0.184300 -0.489631 -0.294932
2013-01-02 -0.985149  1.643598 -1.319322  1.879614
2013-01-03 -0.095298  2.385948 -0.342735  0.572610

In [64]:
df2[0:3]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

In [65]:
df.loc[dates[0]]

A   -0.180055
B   -0.184300
C   -0.489631
D   -0.294932
Name: 2013-01-01 00:00:00, dtype: float64

In [66]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.180055 -0.184300
2013-01-02 -0.985149  1.643598
2013-01-03 -0.095298  2.385948
2013-01-04 -0.720945 -0.965473
2013-01-05 -0.660726  0.894251
2013-01-06  0.196834 -0.040456

In [68]:
df2.loc[:,['C']]

     C
0  1.0
1  1.0
2  1.0
3  1.0

In [70]:
df['20130102':'20130105']

                   A         B         C         D
2013-01-02 -0.985149  1.643598 -1.319322  1.879614
2013-01-03 -0.095298  2.385948 -0.342735  0.572610
2013-01-04 -0.720945 -0.965473 -1.264741  0.109659
2013-01-05 -0.660726  0.894251  0.352209 -0.995835

# DataFrame Slicing <br> loc : value base slicing <br> iloc : index base slicing

In [72]:
product_dic = {
    'pen' : 'pencil',
    'era' : 'erasser',
    'note' : 'notebook',
    'color' : 'colorpen'
}

price_dic = {
    'pen' : 500,
    'era' : 700,
    'note' : 1300,
    'color' : 1600
}

num_dic = {
    'pen' : 12,
    'era' : 6,
    'note' : 10,
    'color' : 7
}

product = pd.Series(product_dic)
price = pd.Series(price_dic)
num = pd.Series(num_dic)

sum = pd.DataFrame({
    'product' : product,
    'price' : price,
    'num' : num
})

print(sum)
print("------------------------------")

print(sum.loc['pen':'note', 'num':])
print("------------------------------")

print(sum.iloc[1:3, 2:])

        product  price  num
pen      pencil    500   12
era     erasser    700    6
note   notebook   1300   10
color  colorpen   1600    7
------------------------------
      num
pen    12
era     6
note   10
------------------------------
      num
era     6
note   10

# DataFrame Data change and insert

In [74]:
product_dic = {
    'pen' : 'pencil',
    'era' : 'erasser',
    'note' : 'notebook',
    'color' : 'colorpen'
}

price_dic = {
    'pen' : 500,
    'era' : 700,
    'note' : 1300,
    'color' : 1600
}

num_dic = {
    'pen' : 12,
    'era' : 6,
    'note' : 10,
    'color' : 7
}

product = pd.Series(product_dic)
price = pd.Series(price_dic)
num = pd.Series(num_dic)

sum = pd.DataFrame({
    'product' : product,
    'price' : price,
    'num' : num
})

print(sum)
print("------------------------------")

sum.loc['pen','num'] = 10

sum.loc['bpen'] = ['ballpen', 1000, 3]

print(sum)

        product  price  num
pen      pencil    500   12
era     erasser    700    6
note   notebook   1300   10
color  colorpen   1600    7
------------------------------
        product  price  num
pen      pencil    500   10
era     erasser    700    6
note   notebook   1300   10
color  colorpen   1600    7
bpen    ballpen   1000    3

In [75]:
df.loc['20130102':'20130105', ['A','B']]

                   A         B
2013-01-02 -0.985149  1.643598
2013-01-03 -0.095298  2.385948
2013-01-04 -0.720945 -0.965473
2013-01-05 -0.660726  0.894251

In [76]:
df.loc['20130102',['A','B']]

A   -0.985149
B    1.643598
Name: 2013-01-02 00:00:00, dtype: float64

# scala value

In [77]:
df.loc[dates[0],'A']

-0.18005532859755596

In [79]:
df.at[dates[0],'A'] # more fast value get

-0.18005532859755596

# input int loction base select

In [80]:
df.iloc[2]

A   -0.095298
B    2.385948
C   -0.342735
D    0.572610
Name: 2013-01-03 00:00:00, dtype: float64

In [81]:
df.iloc[3:5, 0:2] # 정수로 표기된 슬라이스 통해 numpy, python과 유사하게 작동

                   A         B
2013-01-04 -0.720945 -0.965473
2013-01-05 -0.660726  0.894251

In [82]:
df.iloc[[1,2,4],[0,2]] #정수로 표기된 위치값의 리스트를 통해 numpy, python style과 유사해짐

                   A         C
2013-01-02 -0.985149 -1.319322
2013-01-03 -0.095298 -0.342735
2013-01-05 -0.660726  0.352209

In [87]:
df.iloc[1:3,:] # 명시적으로 row 나눔

                   A         B         C         D
2013-01-02 -0.985149  1.643598 -1.319322  1.879614
2013-01-03 -0.095298  2.385948 -0.342735  0.572610

In [86]:
df.iloc[:, 1:3] #명시적으로 columns 나눔

                   B         C
2013-01-01 -0.184300 -0.489631
2013-01-02  1.643598 -1.319322
2013-01-03  2.385948 -0.342735
2013-01-04 -0.965473 -1.264741
2013-01-05  0.894251  0.352209
2013-01-06 -0.040456 -0.176135

In [88]:
df.iloc[1,1] # 명시적으로 특정 value get

1.6435982960095799

In [91]:
df.iat[1,1] # scala value get more fast

1.6435982960095799

In [92]:
df[df.A > 0] # boolean index : data select want for use a column value

                   A         B         C         D
2013-01-06  0.196834 -0.040456 -0.176135 -0.873157

In [93]:
df2 = df.copy()
df2['E'] = ['one','one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.180055 -0.184300 -0.489631 -0.294932    one
2013-01-02 -0.985149  1.643598 -1.319322  1.879614    one
2013-01-03 -0.095298  2.385948 -0.342735  0.572610    two
2013-01-04 -0.720945 -0.965473 -1.264741  0.109659  three
2013-01-05 -0.660726  0.894251  0.352209 -0.995835   four
2013-01-06  0.196834 -0.040456 -0.176135 -0.873157  three

filtering there for use isin() method

In [96]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -0.095298  2.385948 -0.342735  0.572610   two
2013-01-05 -0.660726  0.894251  0.352209 -0.995835  four

In [97]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN       NaN       NaN       NaN
2013-01-02       NaN  1.643598       NaN  1.879614
2013-01-03       NaN  2.385948       NaN  0.572610
2013-01-04       NaN       NaN       NaN  0.109659
2013-01-05       NaN  0.894251  0.352209       NaN
2013-01-06  0.196834       NaN       NaN       NaN

In [107]:
s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range('20130102',periods = 6))

In [108]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [112]:
df['F'] =  s1

In [113]:
df.at[dates[0],'A'] = 0

In [114]:
df.iat[0,1] = 0

In [115]:
df.loc[:,'D'] = np.array([5] * len(df))

In [116]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.489631 -5  NaN
2013-01-02 -0.985149 -1.643598 -1.319322 -5 -1.0
2013-01-03 -0.095298 -2.385948 -0.342735 -5 -2.0
2013-01-04 -0.720945 -0.965473 -1.264741 -5 -3.0
2013-01-05 -0.660726 -0.894251 -0.352209 -5 -4.0
2013-01-06 -0.196834 -0.040456 -0.176135 -5 -5.0

# Missing Value

In [117]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1

In [118]:
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.489631  5  NaN  1.0
2013-01-02 -0.985149  1.643598 -1.319322  5  1.0  1.0
2013-01-03 -0.095298  2.385948 -0.342735  5  2.0  NaN
2013-01-04 -0.720945 -0.965473 -1.264741  5  3.0  NaN

# delete missing value

In [121]:
df1.dropna(how = 'any')

                   A         B         C  D    F    E
2013-01-02 -0.985149  1.643598 -1.319322  5  1.0  1.0

# fill mising value

In [122]:
df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000 -0.489631  5  5.0  1.0
2013-01-02 -0.985149  1.643598 -1.319322  5  1.0  1.0
2013-01-03 -0.095298  2.385948 -0.342735  5  2.0  5.0
2013-01-04 -0.720945 -0.965473 -1.264741  5  3.0  5.0

In [123]:
df.mean()

A   -0.377547
B    0.652978
C   -0.540059
D    5.000000
F    3.000000
dtype: float64

In [124]:
s = pd.Series([1,3,5, np.nan,6,8], index = dates).shift(2)

In [125]:
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [126]:
df.mean(1)

2013-01-01    1.127592
2013-01-02    1.067825
2013-01-03    1.789583
2013-01-04    1.009768
2013-01-05    1.917147
2013-01-06    1.996049
Freq: D, dtype: float64

In [127]:
df.sub(s, axis = 'index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -1.095298  1.385948 -1.342735  4.0  1.0
2013-01-04 -3.720945 -3.965473 -4.264741  2.0  0.0
2013-01-05 -5.660726 -4.105749 -4.647791  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

# import/ export excel

In [131]:
product_dic = {
    'pen' : 'pencil',
    'era' : 'erasser',
    'note' : 'notebook',
    'color' : 'colorpen'
}

price_dic = {
    'pen' : 500,
    'era' : 700,
    'note' : 1300,
    'color' : 1600
}

num_dic = {
    'pen' : 12,
    'era' : 6,
    'note' : 10,
    'color' : 7
}

product = pd.Series(product_dic)
price = pd.Series(price_dic)
num = pd.Series(num_dic)

sum = pd.DataFrame({
    'product' : product,
    'price' : price,
    'num' : num
})

sum.to_csv("C:/Users/ParkHanna/HRD BD/sum.csv" , encoding = "utf-8-sig")

saved = pd.read_csv("C:/Users/ParkHanna/HRD BD/sum.csv", index_col = 0)
print(saved)

        product  price  num
pen      pencil    500   12
era     erasser    700    6
note   notebook   1300   10
color  colorpen   1600    7

In [133]:
product_dic = {
    'pen' : 'pencil',
    'era' : 'erasser',
    'note' : 'notebook',
    'color' : 'colorpen'
}

price_dic = {
    'pen' : 500,
    'era' : 700,
    'note' : np.nan,
    'color' : 1600
}

num_dic = {
    'pen' : 12,
    'era' : 6,
    'note' : 10,
    'color' : 7
}

product = pd.Series(product_dic)
price = pd.Series(price_dic)
num = pd.Series(num_dic)

sum = pd.DataFrame({
    'product' : product,
    'price' : price,
    'num' : num
})
print(sum)
print("------------------------")
print("------------------------")
print(sum.notnull())
print("------------------------")
print(sum.isnull())
print("------------------------")
sum['price'] = sum['price'].fillna('data nothing')
print(sum)

        product   price  num
pen      pencil   500.0   12
era     erasser   700.0    6
note   notebook     NaN   10
color  colorpen  1600.0    7
------------------------
------------------------
       product  price   num
pen       True   True  True
era       True   True  True
note      True  False  True
color     True   True  True
------------------------
       product  price    num
pen      False  False  False
era      False  False  False
note     False   True  False
color    False  False  False
------------------------
        product         price  num
pen      pencil         500.0   12
era     erasser         700.0    6
note   notebook  data nothing   10
color  colorpen        1600.0    7

In [134]:
array1 = pd.Series([1,2,3], index=['A','B','C'])
array2 = pd.Series([4,5,6], index=['B','C','D'])

array1 = array1.add(array2, fill_value = 0)
print(array1)

A    1.0
B    6.0
C    8.0
D    6.0
dtype: float64

In [135]:
array1 = pd.DataFrame([[11,12],[31,41]], index = ['A','B'])
array2 = pd.DataFrame([[10,12,33],[70,55,16],[70,81,19]], index=['B','C','D'])

print('# first dataframe')
print(array1)
print('# second dataframe')
print(array2)

array1 = array1.add(array2, fill_value=0)
print('# result dataframe')
print(array1)

# first dataframe
    0   1
A  11  12
B  31  41
# second dataframe
    0   1   2
B  10  12  33
C  70  55  16
D  70  81  19
# result dataframe
      0     1     2
A  11.0  12.0   NaN
B  41.0  53.0  33.0
C  70.0  55.0  16.0
D  70.0  81.0  19.0

In [138]:
array1 = pd.DataFrame([[1,2],[3,4]], index = ['A','B'])
array2 = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]], index = ['B','C','D'])

print('# first dataframe')
print(array1)
print('----------------------------')

print('# second dataframe')
print(array2)
print('----------------------------')

array1 = array1.add(array2, fill_value=0)
print('# result dataframe')
print(array1)

print('----------------------------')

print('# column 1 sum result')
print('column 1 sum : ', array1[1].sum())

print('----------------------------')
print('# each columns sum result')
print(array1.sum())
print('----------------------------')
print('# each rows sum result')
print(array1.sum(axis=1))

# first dataframe
   0  1
A  1  2
B  3  4
----------------------------
# second dataframe
   0  1  2
B  1  2  3
C  4  5  6
D  7  8  9
----------------------------
# result dataframe
     0    1    2
A  1.0  2.0  NaN
B  4.0  6.0  3.0
C  4.0  5.0  6.0
D  7.0  8.0  9.0
----------------------------
# column 1 sum result
column 1 sum :  21.0
----------------------------
# each columns sum result
0    16.0
1    21.0
2    18.0
dtype: float64
----------------------------
# each rows sum result
A     3.0
B    13.0
C    15.0
D    24.0
dtype: float64

In [4]:
product_dic = {
    'pen' : 'pencil',
    'era' : 'erasser',
    'note' : 'notebook',
    'color' : 'colorpen'
}

price_dic = {
    'pen' : 500,
    'era' : 700,
    'note' : 1000,
    'color' : 1600
}

num_dic = {
    'pen' : 12,
    'era' : 6,
    'note' : 10,
    'color' : 7
}

product = pd.Series(product_dic)
price = pd.Series(price_dic)
num = pd.Series(num_dic)

sum = pd.DataFrame({
    'product' : product,
    'price' : price,
    'num' : num
})

print('=== original data ===')
print(sum)

sum = sum.sort_values('price', ascending = False)
print('=== sort data ===')
print(sum)

=== original data ===
        product  price  num
pen      pencil    500   12
era     erasser    700    6
note   notebook   1000   10
color  colorpen   1600    7
=== sort data ===
        product  price  num
color  colorpen   1600    7
note   notebook   1000   10
era     erasser    700    6
pen      pencil    500   12

In [7]:
df = pd.DataFrame(np.random.randint(1,10,(2,2)), index = [0,1], columns = ['A','B'])


print('== original data ==')
print(df)
print('                                 ')

print('== A is less than 5 ==')
print(df['A'] <= 5)
print('                                 ')

print('== A is less than 5 and B is greater than 8 Data ==')
print(df.query("A <= 5 and B >= 8"))
print('                                 ')

print('== A is less than 5 and B is less than 3 Data ==')
print(df.query("A <= 5 and B <= 3"))

== original data ==
   A  B
0  4  8
1  7  1

== A is less than 5 ==
0     True
1    False
Name: A, dtype: bool

== A is less than 5 and B is greater than 8 Data ==
   A  B
0  4  8

== A is less than 5 and B is less than 3 Data ==
Empty DataFrame
Columns: [A, B]
Index: []

In [8]:
df = pd.DataFrame([[1,2,3,4], [1,2,3,4]], index = [0,1], columns = ["A","B","C","D"])

print("== generated DataFrame ==")
print(df)
print('                                 ')

df = df.apply(lambda x : x+1)
print("== changed DataFrame")
print(df)
print('                                 ')

def addOne(x):
    return x + 1

df = df.apply(addOne)

print("== method applied DataFrame")
print(df)

== generated DataFrame ==
   A  B  C  D
0  1  2  3  4
1  1  2  3  4

== changed DataFrame
   A  B  C  D
0  2  3  4  5
1  2  3  4  5

== method applied DataFrame
   A  B  C  D
0  3  4  5  6
1  3  4  5  6

In [9]:
df = pd.DataFrame([
    ['pen', 'pen', 'era', 'color'],
    ['note', 'color', 'pen', 'era']],
    index = [0,1],
    columns = ['A', 'B', 'C', 'D'])

print("== generated original data ==")
print(df)
print('                                 ')

print("== changed data ==")
df = df.replace({'pen' : 'pencil'})
print(df)

== generated original data ==
      A      B    C      D
0   pen    pen  era  color
1  note  color  pen    era

== changed data ==
        A       B       C      D
0  pencil  pencil     era  color
1    note   color  pencil    era

In [11]:
df = pd.DataFrame([
    ['Apple', 7, 'Fruit'],
    ['Banana', 3, 'Fruit'],
    ['WaterMelon', 6, 'Fruit'],
    ['Beef', 5, 'Meal'],
    ['Kimchi',4,'Meal']],
    columns = ["Name", "Frequency", "Type"])

print('== generated original data ==')
print(df)
print('                  ')

print('== total frequency by type data ==')
print(df.groupby(['Type']).sum())
print('                 ')

print('== minimun, maximun and average data of groups by type ==')
print(df.groupby(['Type']).aggregate([min,max,np.average]))

== generated original data ==
         Name  Frequency   Type
0       Apple          7  Fruit
1      Banana          3  Fruit
2  WaterMelon          6  Fruit
3        Beef          5   Meal
4      Kimchi          4   Meal

== total frequency by type data ==
       Frequency
Type
Fruit         16
Meal           9

== minimun, maximun and average data of groups by type ==
      Frequency
            min max   average
Type
Fruit         3   7  5.333333
Meal          4   5  4.500000

C:\Users\ParkHanna\AppData\Local\Temp\ipykernel_10388\2979369174.py:18: FutureWarning: ['Name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  print(df.groupby(['Type']).aggregate([min,max,np.average]))

In [17]:
df = pd.DataFrame([
    ['Apple', 7, 5, 'Fruit'],
    ['Banana', 3, 6, 'Fruit'],
    ['WaterMelon', 6, 2, 'Fruit'],
    ['Beef', 5, 3, 'Meal'],
    ['Kimchi',4, 4, 'Meal']],
    columns = ["Name", "Frequency", "Importance", "Type"])

print('== generated original data ==')
print(df)
print('                  ')

def my_filter(data):
    return data["Frequency"].mean() >= 5

print('== Frequency of 5 or more data ==')
df = df.groupby("Type").filter(my_filter)
print(df)
print('                  ')

print('== Type of Fruit data ==')
df = df.groupby("Type").get_group("Fruit")
print(df)

print('                  ')
print('== Frequency of average and difference data by type ==')
df["Gap"] = df.groupby("Type")["Frequency"].apply(lambda x : x - x.mean())
print(df)

== generated original data ==
         Name  Frequency  Importance   Type
0       Apple          7           5  Fruit
1      Banana          3           6  Fruit
2  WaterMelon          6           2  Fruit
3        Beef          5           3   Meal
4      Kimchi          4           4   Meal

== Frequency of 5 or more data ==
         Name  Frequency  Importance   Type
0       Apple          7           5  Fruit
1      Banana          3           6  Fruit
2  WaterMelon          6           2  Fruit

== Type of Fruit data ==
         Name  Frequency  Importance   Type
0       Apple          7           5  Fruit
1      Banana          3           6  Fruit
2  WaterMelon          6           2  Fruit

== Frequency of average and difference data by type ==
         Name  Frequency  Importance   Type       Gap
0       Apple          7           5  Fruit  1.666667
1      Banana          3           6  Fruit -2.333333
2  WaterMelon          6           2  Fruit  0.666667

In [18]:
df = pd.DataFrame(
    np.random.randint(1, 10, (4,4)),
    index = [['1st', '1st', '2nd', '2nd'], ['attack', 'defence', 'attack', 'defence']],
    columns = ['round 1','round 2','round 3','round 4']
)

print('== generated original data ==')
print(df)
print(' ')

print('== secondary data for round 1 and 2 ==')
print(df[['round 1','round 2']].loc['2nd'])

== generated original data ==
             round 1  round 2  round 3  round 4
1st attack         6        1        7        2
    defence        6        3        5        8
2nd attack         4        9        2        3
    defence        9        4        2        8

== secondary data for round 1 and 2 ==
         round 1  round 2
attack         4        9
defence        9        4

In [19]:
df = pd.DataFrame([
    ['Apple', 7, 5, 'Fruit'],
    ['Banana', 3, 6, 'Fruit'],
    ['WaterMelon', 6, 2, 'Fruit'],
    ['Beef', 5, 3, 'Meal'],
    ['Kimchi',4, 4, 'Meal']],
    columns = ["Name", "Frequency", "Importance", "Type"])

print('== generated original data ==')
print(df)
print('                  ')

df = df.pivot_table(
    index = "Importance", columns = "Type", values = "Frequency",
    aggfunc = np.max
)

print('== pivot table data ==')
print(df)

== generated original data ==
         Name  Frequency  Importance   Type
0       Apple          7           5  Fruit
1      Banana          3           6  Fruit
2  WaterMelon          6           2  Fruit
3        Beef          5           3   Meal
4      Kimchi          4           4   Meal

== pivot table data ==
Type        Fruit  Meal
Importance
2             6.0   NaN
3             NaN   5.0
4             NaN   4.0
5             7.0   NaN
6             3.0   NaN